Repository: GigaDuckAI/conduck
Catalog: Conduck/Conduck/Localizable.xcstrings
Source language: en
Languages: es, ja, zh_hans

# settings.personalAI.default.picker.empty
source: No gateways are set up on this device yet. Connect one in Personal AI and it'll appear here.
es: Aún no hay pasarelas configuradas en este dispositivo. Conecta una en IA personal y aparecerá aquí.
ja: このデバイスにはゲートウェイがまだ設定されていません。パーソナルAIで接続すると、ここに表示されます。
zh_hans: 此设备尚未设置网关。在“个人 AI”中连接一个后，它会显示在这里。

# settings.personalAI.default.picker.footer
source: New chats start here until you use a different gateway, then they follow that one. Existing chats keep the one they started on.
es: Los chats nuevos empiezan aquí hasta que uses otra pasarela; después siguen a esa. Los chats existentes conservan aquella en la que empezaron.
ja: 新しいチャットはここで始まり、別のゲートウェイを使うと、その後はそちらを使います。既存のチャットは開始時のゲートウェイを保持します。
zh_hans: 新对话使用此网关，直到你换用其他网关，之后会跟随新选择。现有对话保持原来的网关。

# settings.personalAI.default.picker.noChoice.body
source: Pick a gateway below and new chats will start on it.
es: Elige una pasarela abajo y los chats nuevos empezarán en ella.
ja: 下でゲートウェイを選ぶと、新しいチャットはそれを使います。
zh_hans: 请在下方选择网关，新对话将使用它。

# settings.personalAI.default.picker.noChoice.title
source: No default yet
es: Aún sin predeterminada
ja: デフォルトは未設定です
zh_hans: 尚无默认网关

# settings.personalAI.default.picker.title
source: Default for new chats
es: Predeterminada para chats nuevos
ja: 新しいチャットのデフォルト
zh_hans: 新对话默认设置

# settings.personalAI.default.picker.unavailable.body
source: It's still your default, and it'll work again on its own if it's just waiting on iCloud. To use a different gateway for new chats on this device, pick one below.
es: Sigue siendo tu opción predeterminada y volverá a funcionar por sí sola si solo espera a iCloud. Para usar otra pasarela en los chats nuevos de este dispositivo, elige una abajo.
ja: 引き続きデフォルトに設定されています。iCloud同期を待っているだけなら自動的に復旧します。このデバイスで新しいチャットに別のゲートウェイを使うには、下で選んでください。
zh_hans: 它仍是默认网关，如果只是等待 iCloud 同步，稍后会自动恢复。要为此设备的新对话使用其他网关，请在下方选择。

# settings.personalAI.default.picker.unavailable.title
source: %@ isn't available here
es: %@ no está disponible aquí
ja: %@はここでは利用できません
zh_hans: %@ 在此处不可用

# settings.personalAI.default.picker.unavailable.watch.body
source: It's still the gateway your Apple Watch is pinned to, and it'll work again on its own if it's just waiting on iCloud. To pin a different one, pick it below.
es: Sigue siendo la pasarela fijada para tu Apple Watch y volverá a funcionar por sí sola si solo espera a iCloud. Para fijar otra, elígela abajo.
ja: 引き続きApple Watchの固定ゲートウェイに設定されています。iCloud同期を待っているだけなら自動的に復旧します。別のゲートウェイに固定するには、下で選んでください。
zh_hans: Apple Watch 仍固定使用此网关，如果只是等待 iCloud 同步，稍后会自动恢复。要固定使用其他网关，请在下方选择。

# settings.personalAI.default.selector.label
source: Default for new chats
es: Predeterminada para chats nuevos
ja: 新しいチャットのデフォルト
zh_hans: 新对话默认设置

# settings.personalAI.default.unavailable.footer.ipad
source: %@ isn't available on this iPad, so anything that starts a chat from outside the app has nowhere to go. It'll work again on its own if it's waiting on iCloud — or pick a gateway that works here.
es: %@ no está disponible en este iPad, así que lo que inicie un chat desde fuera de la app no tiene destino. Volverá a funcionar por sí sola si espera a iCloud, o puedes elegir una pasarela que funcione aquí.
ja: %@はこのiPadで利用できないため、アプリ外から開始するチャットは送信できません。iCloud同期を待っているだけなら自動的に復旧します。ここで使えるゲートウェイを選ぶこともできます。
zh_hans: %@ 在此 iPad 不可用，因此从 App 外发起的对话没有可用目标。如果正在等待 iCloud 同步，稍后会自动恢复；你也可以选择此设备可用的网关。

# settings.personalAI.default.unavailable.footer.iphone
source: %@ isn't available on this iPhone, so anything that starts a chat from outside the app has nowhere to go. It'll work again on its own if it's waiting on iCloud — or pick a gateway that works here.
es: %@ no está disponible en este iPhone, así que lo que inicie un chat desde fuera de la app no tiene destino. Volverá a funcionar por sí sola si espera a iCloud, o puedes elegir una pasarela que funcione aquí.
ja: %@はこのiPhoneで利用できないため、アプリ外から開始するチャットは送信できません。iCloud同期を待っているだけなら自動的に復旧します。ここで使えるゲートウェイを選ぶこともできます。
zh_hans: %@ 在此 iPhone 不可用，因此从 App 外发起的对话没有可用目标。如果正在等待 iCloud 同步，稍后会自动恢复；你也可以选择此设备可用的网关。

# settings.personalAI.default.unavailable.footer.mac
source: %@ isn't available on this Mac, so anything that starts a chat from outside the app has nowhere to go. It'll work again on its own if it's waiting on iCloud — or pick a gateway that works here.
es: %@ no está disponible en este Mac, así que lo que inicie un chat desde fuera de la app no tiene destino. Volverá a funcionar por sí sola si espera a iCloud, o puedes elegir una pasarela que funcione aquí.
ja: %@はこのMacで利用できないため、アプリ外から開始するチャットは送信できません。iCloud同期を待っているだけなら自動的に復旧します。ここで使えるゲートウェイを選ぶこともできます。
zh_hans: %@ 在此 Mac 不可用，因此从 App 外发起的对话没有可用目标。如果正在等待 iCloud 同步，稍后会自动恢复；你也可以选择此设备可用的网关。

# settings.personalAI.fullAgent.footer
source: Tools and file attachments. Conduck sends each chat's context with every message.
es: Herramientas y archivos adjuntos. Conduck envía el contexto de cada chat con cada mensaje.
ja: ツールとファイル添付に対応。Conduckはメッセージごとに会話の履歴を送信します。
zh_hans: 支持工具和文件附件。Conduck 每次发送消息时都会附上该对话的上下文。

# settings.personalAI.fullAgent.header
source: Full agent gateways
es: Pasarelas de agentes completas
ja: 完全なエージェントゲートウェイ
zh_hans: 完整智能体网关

# settings.personalAI.fullAgent.header.v2
source: Runs on your own server
es: Se ejecuta en tu propio servidor
ja: 自分のサーバーで稼働
zh_hans: 在自己的服务器上运行

# settings.personalAI.hostedBadge
source: Hosted
es: Alojado
ja: ホスト型
zh_hans: 托管

# settings.personalAI.hostedModel.footer
source: No server needed. No tools or file access.
es: No necesita servidor. Sin herramientas ni acceso a archivos.
ja: サーバー不要。ツールやファイルへのアクセスはありません。
zh_hans: 无需服务器，不支持工具或文件访问。

# settings.personalAI.hostedModel.footer.v2
source: Conduck talks straight to the provider. No tools, no file transfer.
es: Conduck habla directamente con el proveedor. Sin herramientas ni transferencia de archivos.
ja: Conduckはプロバイダーに直接接続します。ツールやファイル転送はありません。
zh_hans: Conduck 直接与服务商通信，不支持工具或文件传输。

# settings.personalAI.hostedModel.header
source: Hosted model
es: Modelo alojado
ja: ホスト型モデル
zh_hans: 托管模型

# settings.personalAI.hostedModel.header.v2
source: No server needed
es: No necesita servidor
ja: サーバー不要
zh_hans: 无需服务器

# settings.personalAI.newChats.header
source: New chats use
es: Los chats nuevos usan
ja: 新しいチャットに使うAI
zh_hans: 新对话使用

# settings.personalAI.section.customHeader.v2
source: You supply the address
es: Tú proporcionas la dirección
ja: アドレスを自分で指定
zh_hans: 由你提供地址

# settings.personalAI.tip.newChats.a11y
source: About New chats use
es: Acerca de Los chats nuevos usan
ja: 「新しいチャットに使うAI」について
zh_hans: 关于新对话使用的网关

# settings.personalAI.tip.newChats.message
source: A new chat on this device continues on the gateway you last used, so you don’t have to pick it again each time. This setting is where the first one starts, and where the Action Button and Shortcuts send when nothing asked you to choose.
es: Un chat nuevo en este dispositivo continúa en la última pasarela que usaste para que no tengas que elegirla cada vez. Este ajuste define dónde empieza el primero y adónde envían el botón de acción y los atajos cuando nada te pidió elegir.
ja: このデバイスの新しいチャットは、最後に使ったゲートウェイで続くため、毎回選ぶ必要はありません。この設定は最初の送信先と、選択を求められなかった場合のアクションボタンやショートカットの送信先を決めます。
zh_hans: 此设备的新对话会使用上次使用的网关，无需每次重新选择。此设置决定首次对话使用哪个网关，以及未询问你选择时，操作按钮和快捷指令发送到哪里。

# settings.personalAI.tip.newChats.title
source: Where new chats start
es: Dónde empiezan los chats nuevos
ja: 新しいチャットの開始先
zh_hans: 新对话的起点

# settings.quickCapture.footer.ipad
source: Applies to asks from Control Center or the Lock Screen on this iPad. In-app messages use the conversation you have open.
es: Se aplica a las preguntas del centro de control o de la pantalla de bloqueo de este iPad. Los mensajes dentro de la app usan la conversación que tienes abierta.
ja: このiPadのコントロールセンターやロック画面からの質問に適用されます。アプリ内のメッセージは、開いている会話を使います。
zh_hans: 适用于此 iPad 的控制中心或锁定屏幕提问。App 内消息使用当前打开的对话。

# settings.quickCapture.footer.iphone
source: Applies to asks from the Action Button, Lock Screen, or Control Center on this iPhone. In-app messages use the conversation you have open.
es: Se aplica a las preguntas del botón de acción, la pantalla de bloqueo o el centro de control de este iPhone. Los mensajes dentro de la app usan la conversación que tienes abierta.
ja: このiPhoneのアクションボタン、ロック画面、コントロールセンターからの質問に適用されます。アプリ内のメッセージは、開いている会話を使います。
zh_hans: 适用于此 iPhone 的操作按钮、锁定屏幕或控制中心提问。App 内消息使用当前打开的对话。

# settings.quickCapture.footer.mac
source: Last conversation: Pick a chat in the popover to override it. Spoken replies are read aloud with your Text-to-Speech voice.
es: Última conversación: elige un chat en la ventana emergente para cambiarla. Las respuestas habladas se leen con tu voz de Texto a voz.
ja: 前回の会話：ポップオーバーでチャットを選ぶと変更できます。音声の返信は、テキスト読み上げで選んだ音声を使います。
zh_hans: 上次对话：在弹出窗口中选择其他对话可覆盖此设置。语音回复使用你的文字转语音声音朗读。

# settings.quickCapture.header.ipad
source: Control Center & Lock Screen
es: Centro de control y pantalla de bloqueo
ja: コントロールセンターとロック画面
zh_hans: 控制中心与锁定屏幕

# settings.quickCapture.header.iphone
source: Action Button & Control Center
es: Botón de acción y centro de control
ja: アクションボタンとコントロールセンター
zh_hans: 操作按钮与控制中心

# settings.quickCapture.header.mac
source: Menu Bar
es: Barra de menús
ja: メニューバー
zh_hans: 菜单栏

# settings.quickCapture.speakReplies.label
source: Speak replies
es: Leer respuestas en voz alta
ja: 返信を読み上げ
zh_hans: 朗读回复

# settings.remoteAgent.advanced.header
source: Advanced
es: Avanzado
ja: 詳細
zh_hans: 高级

# settings.remoteAgent.apiKey.sheet.title
source: Enter API key
es: Introduce la clave de API
ja: APIキーを入力
zh_hans: 输入 API 密钥

# settings.remoteAgent.auth.keyless.helper
source: Keyless — no token sent. Use only on a private network (Tailscale/LAN); HTTPS encrypts traffic but doesn't limit who can reach your gateway.
es: Sin clave: no se envía ningún token. Úsalo solo en una red privada (Tailscale/LAN); HTTPS cifra el tráfico, pero no limita quién puede acceder a tu pasarela.
ja: キーなし — 認証トークンは送信しません。非公開ネットワーク（Tailscale/LAN）でのみ使ってください。HTTPSは通信を暗号化しますが、ゲートウェイへの接続者を制限しません。
zh_hans: 免密钥，不发送令牌。仅适用于私有网络（Tailscale/LAN）；HTTPS 会加密流量，但不会限制谁能访问网关。

# settings.remoteAgent.auth.requiresToken.helper
source: Turn off only for a keyless gateway on a private network (Tailscale/LAN).
es: Desactívalo solo para una pasarela sin clave en una red privada (Tailscale/LAN).
ja: 非公開ネットワーク（Tailscale/LAN）上のキー不要のゲートウェイの場合のみ無効にしてください。
zh_hans: 仅在私有网络（Tailscale/LAN）中的免密钥网关上关闭。

# settings.remoteAgent.auth.requiresToken.label
source: Requires a bearer token
es: Requiere un token de portador
ja: Bearer認証トークンを必須にする
zh_hans: 需要 Bearer 令牌

# settings.remoteAgent.badge.header
source: Badge
es: Distintivo
ja: バッジ
zh_hans: 标识

# settings.remoteAgent.badge.helper
source: Shown on Apple Watch and CarPlay so you can tell gateways apart.
es: Se muestra en Apple Watch y CarPlay para distinguir las pasarelas.
ja: ゲートウェイを区別するため、Apple WatchとCarPlayに表示します。
zh_hans: 显示在 Apple Watch 和 CarPlay 上，用于区分网关。

# settings.remoteAgent.badge.monogram.label
source: Monogram
es: Monograma
ja: モノグラム
zh_hans: 字母标识

# settings.remoteAgent.badge.monogram.placeholder
source: 1–2 letters
es: 1–2 letras
ja: 1〜2文字
zh_hans: 1–2 个字母

# settings.remoteAgent.bearerToken.sheet.title
source: Enter bearer token
es: Introduce el token de portador
ja: Bearer認証トークンを入力
zh_hans: 输入 Bearer 令牌

# settings.remoteAgent.certRow.label
source: Server certificate
es: Certificado del servidor
ja: サーバー証明書
zh_hans: 服务器证书

# settings.remoteAgent.certRow.value.automatic
source: Automatic
es: Automática
ja: 自動
zh_hans: 自动

# settings.remoteAgent.certRow.value.automaticSaveRequired
source: Automatic · Save required
es: Automática · Hay que guardar
ja: 自動 · 保存が必要
zh_hans: 自动 · 需要保存

# settings.remoteAgent.certRow.value.pinned
source: Pinned on this device
es: Huella fijada en este dispositivo
ja: このデバイスで固定済み
zh_hans: 已在此设备固定

# settings.remoteAgent.certRow.value.pinnedSaveRequired
source: Pinned · Save required
es: Huella fijada · Hay que guardar
ja: 固定済み · 保存が必要
zh_hans: 已固定 · 需要保存

# settings.remoteAgent.clear.button
source: Forget
es: Olvidar
ja: 登録解除
zh_hans: 移除设置

# settings.remoteAgent.connection.footer.saveScoped
source: Changes apply when you Save.
es: Los cambios se aplican al Guardar.
ja: 変更は保存時に適用されます。
zh_hans: 更改在保存时生效。

# settings.remoteAgent.connection.header
source: Connection
es: Conexión
ja: 接続
zh_hans: 连接

# settings.remoteAgent.credentialHelp.address.body
source: It's the https address of that same server. Unless you changed it, the port is:
es: Es la dirección https de ese mismo servidor. Salvo que lo hayas cambiado, el puerto es:
ja: 同じサーバーのhttpsアドレスです。変更していなければ、ポートは次のとおりです：
zh_hans: 这是同一服务器的 https 地址。除非你更改过，端口为：

# settings.remoteAgent.credentialHelp.address.header
source: The gateway URL
es: La URL de la pasarela
ja: ゲートウェイURL
zh_hans: 网关 URL

# settings.remoteAgent.credentialHelp.address.health
source: To check the server is alive at all, open this route in a browser — it answers even when the AI endpoint is switched off:
es: Para comprobar si el servidor responde, abre esta ruta en un navegador: responde incluso con el punto de conexión de IA desactivado:
ja: サーバー自体が稼働しているか確認するには、このルートをブラウザで開いてください。AIエンドポイントが無効でも応答します：
zh_hans: 要检查服务器是否正在运行，请在浏览器中打开此路由。即使 AI 端点关闭，它也会响应：

# settings.remoteAgent.credentialHelp.button
source: Where do I find Gateway URL and Bearer token?
es: ¿Dónde encuentro la URL de la pasarela y el token de portador?
ja: ゲートウェイURLとBearer認証トークンはどこにありますか？
zh_hans: 在哪里查找网关 URL 和 Bearer 令牌？

# settings.remoteAgent.credentialHelp.done
source: Done
es: Listo
ja: 完了
zh_hans: 完成

# settings.remoteAgent.credentialHelp.intro
source: Both values belong to the server you run. You're looking for them on that machine, not on this device.
es: Ambos valores pertenecen al servidor que gestionas. Debes buscarlos en esa máquina, no en este dispositivo.
ja: どちらも運用するサーバーの情報です。このデバイスではなく、そのマシンで確認してください。
zh_hans: 两项都属于你运行的服务器，需要在那台机器上查找，而非此设备。

# settings.remoteAgent.credentialHelp.title
source: Where do I find these?
es: ¿Dónde encuentro estos datos?
ja: これらはどこにありますか？
zh_hans: 在哪里查找？

# settings.remoteAgent.credentialHelp.token.header
source: The bearer token
es: El token de portador
ja: Bearer認証トークン
zh_hans: Bearer 令牌

# settings.remoteAgent.credentialHelp.token.keyLabel
source: Key
es: Clave
ja: キー
zh_hans: 密钥

# settings.remoteAgent.credentialHelp.troubleshooting
source: Still won't connect? Read the setup guide
es: ¿Sigue sin conectar? Lee la guía de configuración
ja: まだ接続できませんか？設定ガイドを読む
zh_hans: 仍无法连接？阅读设置指南

# settings.remoteAgent.custom.name.duplicate
source: Another gateway already uses this name.
es: Otra pasarela ya usa este nombre.
ja: この名前は別のゲートウェイが使っています。
zh_hans: 另一个网关已使用此名称。

# settings.remoteAgent.custom.name.label
source: Name
es: Nombre
ja: 名前
zh_hans: 名称

# settings.remoteAgent.custom.name.placeholder
source: My gateway
es: Mi pasarela
ja: 自分のゲートウェイ
zh_hans: 我的网关

# settings.remoteAgent.customCheck.body.v2
source: On the server, download the script: %@. Then run bash conduck-connect.sh --check-server — or --check-adapter if this is an adapter built for Conduck. It only sends test requests; nothing on the server changes.
es: En el servidor, descarga el script: %@. Después ejecuta bash conduck-connect.sh --check-server, o --check-adapter si es un adaptador creado para Conduck. Solo envía solicitudes de prueba; no cambia nada en el servidor.
ja: サーバーでスクリプトをダウンロードしてください：%@。続いてbash conduck-connect.sh --check-serverを実行します。Conduck用のアダプターなら--check-adapterを使います。テストリクエストを送るだけで、サーバーは変更しません。
zh_hans: 在服务器上下载脚本：%@。然后运行 bash conduck-connect.sh --check-server；如果是为 Conduck 构建的适配器，则使用 --check-adapter。它仅发送测试请求，不会更改服务器。

# settings.remoteAgent.customCheck.title.v2
source: Run a server check
es: Ejecutar una comprobación del servidor
ja: サーバーの確認を実行
zh_hans: 运行服务器检查

# settings.remoteAgent.customGateway.add.v2
source: Set up a custom server
es: Configurar un servidor personalizado
ja: カスタムサーバーを設定
zh_hans: 设置自定义服务器

# settings.remoteAgent.customGateway.addAtCap.v2
source: Set up a custom server with Pro
es: Configurar un servidor personalizado con Pro
ja: Proでカスタムサーバーを設定
zh_hans: 通过 Pro 设置自定义服务器

# settings.remoteAgent.customGateway.capHint.v2
source: Delete a custom server above to add another.
es: Elimina un servidor personalizado de arriba para añadir otro.
ja: 別のサーバーを追加するには、上のカスタムサーバーを削除してください。
zh_hans: 删除上方一个自定义服务器以添加其他服务器。

# settings.remoteAgent.customHelp.adapter.body
source: If you built your own AI and it can't answer web requests yet, it needs a small front door — an adapter — that Conduck can knock on. The AI coding tool you built it with can write that adapter for you: copy the instructions and paste them into that tool.
es: Si creaste tu propia IA y aún no puede responder a solicitudes web, necesita una pequeña entrada, un adaptador, a la que Conduck pueda llamar. La herramienta de programación con IA que usaste puede escribir ese adaptador por ti: copia las instrucciones y pégalas en esa herramienta.
ja: 自作のAIがまだWebリクエストに応答できない場合、Conduckが接続できる小さな窓口、アダプターが必要です。AIの作成に使ったコーディングツールがアダプターを書けます。手順をコピーしてそのツールに貼り付けてください。
zh_hans: 如果你构建的 AI 尚无法响应网络请求，它需要一个小型入口，也就是适配器，供 Conduck 连接。构建它的 AI 编程工具可以帮你编写适配器：复制说明并粘贴到该工具中。

# settings.remoteAgent.customHelp.adapter.contract
source: Read the adapter contract
es: Leer el contrato del adaptador
ja: アダプターの仕様を読む
zh_hans: 阅读适配器协议

# settings.remoteAgent.customHelp.adapter.copy
source: Copy adapter instructions
es: Copiar instrucciones del adaptador
ja: アダプターの手順をコピー
zh_hans: 复制适配器说明

# settings.remoteAgent.customHelp.adapter.guide
source: See how it works
es: Ver cómo funciona
ja: 仕組みを見る
zh_hans: 查看工作原理

# settings.remoteAgent.customHelp.adapter.header
source: My AI isn't a server yet
es: Mi IA aún no es un servidor
ja: 自分のAIはまだサーバーではありません
zh_hans: 我的 AI 尚未以服务器形式运行

# settings.remoteAgent.customHelp.api.examples
source: LiteLLM, Ollama, vLLM, LM Studio — or an adapter you built.
es: LiteLLM, Ollama, vLLM, LM Studio o un adaptador que creaste.
ja: LiteLLM、Ollama、vLLM、LM Studio、または自作のアダプター。
zh_hans: LiteLLM、Ollama、vLLM、LM Studio，或你构建的适配器。

# settings.remoteAgent.customHelp.api.header
source: I already run an OpenAI-compatible server
es: Ya ejecuto un servidor compatible con OpenAI
ja: OpenAI互換サーバーをすでに運用しています
zh_hans: 我已运行兼容 OpenAI 的服务器

# settings.remoteAgent.customHelp.api.test
source: Test Connection checks that Conduck can reach this address, authenticate, and read its model list. To exercise the chat wire too, download the script on that machine with %@ and run bash conduck-connect.sh --check-server. After a PASS, the interactive script can continue into setup.
es: Probar conexión comprueba que Conduck puede acceder a esta dirección, autenticarse y leer su lista de modelos. Para probar también el protocolo de chat, descarga el script en esa máquina con %@ y ejecuta bash conduck-connect.sh --check-server. Tras un PASS, el script interactivo puede continuar con la configuración.
ja: 「接続をテスト」は、このアドレスへの接続、認証、モデル一覧の読み取りを確認します。チャット通信も確認するには、そのマシンで%@を使ってスクリプトをダウンロードし、bash conduck-connect.sh --check-serverを実行してください。PASS後は対話式スクリプトで設定を続けられます。
zh_hans: “测试连接”会检查 Conduck 能否访问此地址、通过身份验证并读取模型列表。要同时测试聊天通信，请在该机器上用 %@ 下载脚本，并运行 bash conduck-connect.sh --check-server。得到 PASS 后，交互脚本可继续完成设置。

# settings.remoteAgent.customHelp.api.test.v2
source: The connection test checks that Conduck can reach this address, authenticate, and read its model list. To exercise the chat wire too, download the script on that machine with %@ and run bash conduck-connect.sh --check-server. After a PASS, the interactive script can continue into setup.
es: La prueba de conexión comprueba que Conduck puede acceder a esta dirección, autenticarse y leer su lista de modelos. Para probar también el protocolo de chat, descarga el script en esa máquina con %@ y ejecuta bash conduck-connect.sh --check-server. Tras un PASS, el script interactivo puede continuar con la configuración.
ja: 接続テストは、このアドレスへの接続、認証、モデル一覧の読み取りを確認します。チャット通信も確認するには、そのマシンで%@を使ってスクリプトをダウンロードし、bash conduck-connect.sh --check-serverを実行してください。PASS後は対話式スクリプトで設定を続けられます。
zh_hans: 连接测试会检查 Conduck 能否访问此地址、通过身份验证并读取模型列表。要同时测试聊天通信，请在该机器上用 %@ 下载脚本，并运行 bash conduck-connect.sh --check-server。得到 PASS 后，交互脚本可继续完成设置。

# settings.remoteAgent.customHelp.api.token.body
source: Whatever password that address checks before answering — set in your framework's config, or by a proxy in front of it. If your server deliberately has no password on a private network, turn off “Requires a bearer token” instead.
es: La contraseña que esa dirección comprueba antes de responder, definida en la configuración de tu framework o en un proxy delante de él. Si tu servidor está expresamente sin contraseña en una red privada, desactiva “Requiere un token de portador”.
ja: そのアドレスが応答前に確認するパスワードです。フレームワークの設定や前段のプロキシで指定します。非公開ネットワーク上で意図的にパスワードを不要にしている場合は、「Bearer認証トークンを必須にする」を無効にしてください。
zh_hans: 该地址响应前所核验的密码，由框架配置或前置代理设定。如果服务器在私有网络中刻意不设密码，请关闭“需要 Bearer 令牌”。

# settings.remoteAgent.customHelp.api.token.label
source: Bearer token
es: Token de portador
ja: Bearer認証トークン
zh_hans: Bearer 令牌

# settings.remoteAgent.customHelp.api.url.body
source: The https:// address your server is reachable at from this device — a Tailscale name, a domain, or a LAN address. Paste just the base address; Conduck adds /v1/… itself.
es: La dirección https:// donde tu servidor es accesible desde este dispositivo: un nombre de Tailscale, un dominio o una dirección LAN. Pega solo la dirección base; Conduck añade /v1/… por su cuenta.
ja: このデバイスからサーバーに接続できるhttps://アドレスです。Tailscale名、ドメイン、LANアドレスなどを使えます。ベースアドレスだけを貼り付けてください。Conduckが/v1/…を追加します。
zh_hans: 此设备能够访问的服务器 https:// 地址，例如 Tailscale 名称、域名或局域网地址。只粘贴基础地址，Conduck 会自行添加 /v1/…。

# settings.remoteAgent.customHelp.api.url.label
source: Gateway URL
es: URL de la pasarela
ja: ゲートウェイURL
zh_hans: 网关 URL

# settings.remoteAgent.customHelp.api.url.portNote
source: A framework's own port (Ollama's 11434, for example) is usually a private, http-only door on the machine itself — Conduck needs the https address that door is published at.
es: El puerto propio de un framework (por ejemplo, el 11434 de Ollama) suele ser una entrada privada solo http en la propia máquina: Conduck necesita la dirección https donde se publica esa entrada.
ja: フレームワーク固有のポート（例：Ollamaの11434）は通常、そのマシン内だけのhttp専用接続です。Conduckには、その接続を公開しているhttpsアドレスが必要です。
zh_hans: 框架本身的端口（例如 Ollama 的 11434）通常是机器上私有、仅支持 http 的入口。Conduck 需要该入口对外提供的 https 地址。

# settings.remoteAgent.customHelp.api.url.portNote.v2
source: A framework's own port (Ollama's 11434, for example) is usually a private, http-only door on the machine itself — Conduck needs the https address that door is published at. Some servers, Ollama among them, also check the Host header — the name a request says it is addressed to — and refuse anything still carrying the public name, so whatever publishes it may need to rewrite that to the local one.
es: El puerto propio de un framework (por ejemplo, el 11434 de Ollama) suele ser una entrada privada solo http en la propia máquina: Conduck necesita la dirección https donde se publica esa entrada. Algunos servidores, incluido Ollama, también comprueban la cabecera Host, el nombre al que una solicitud dice dirigirse, y rechazan solicitudes que aún llevan el nombre público, así que el servicio que lo publica puede necesitar sustituirlo por el nombre local.
ja: フレームワーク固有のポート（例：Ollamaの11434）は通常、そのマシン内だけのhttp専用接続です。Conduckには公開先のhttpsアドレスが必要です。Ollamaなどの一部のサーバーは、リクエストの宛先名を示すHostヘッダーも確認し、公開名のままなら拒否します。そのため、公開を担うサービスでローカル名に書き換える必要がある場合があります。
zh_hans: 框架本身的端口（例如 Ollama 的 11434）通常是机器上私有、仅支持 http 的入口。Conduck 需要该入口对外提供的 https 地址。包括 Ollama 在内的部分服务器也会检查 Host 请求头，即请求声明的目标名称，并拒绝仍携带公共名称的请求，因此对外提供服务的程序可能需要将它改为本地名称。

# settings.remoteAgent.customHelp.button
source: What do I enter for Gateway URL and Bearer token?
es: ¿Qué introduzco como URL de la pasarela y token de portador?
ja: ゲートウェイURLとBearer認証トークンには何を入力しますか？
zh_hans: 网关 URL 和 Bearer 令牌应填写什么？
